import { PrognozType } from './constants.js';
import { PrognozMessages } from './constants.js';

export class PrognozBlockParameters {
    constructor(prognoz) {
        this.prognoz = prognoz;
    }
    async renderBlockParameters(){
            const self = this.prognoz;
            const $parent = $('.block-parameters[block="parameters"] .block-parameters__body');
            const $titleBlock = $parent.closest('.page__block').find('.section__title');

            window.Reports.common.waiter.show("GetDatecloseKFO");

            let _dtCloseKFO = await window.Reports.prognozApi.getDatecloseKFO();
            if (_dtCloseKFO?.DATE_CLOSE_KFO) {
                self.dtCloseKFO = self.parseDate(_dtCloseKFO?.DATE_CLOSE_KFO);
            }
            window.Reports.common.waiter.hide("GetDatecloseKFO");
            switch (self.type) {
                case PrognozType.TYPE_0: // Сценарий
                    const $formScenario = $(`
                        <div class="block-parameters__item" required="">
                            <p class="block-parameters__text">Сценарий прогноза RCFF <span style="color: red;">*</span></p>
                            <label class="dropdown">
                                <select id="scenarioRCFF"></select>
                                <svg width="18" height="18" viewBox="0 0 32 32" fill="#004C97"
                                    xmlns="http://www.w3.org/2000/svg">
                                    <path
                                        d="M26.7074 12.7075L16.7074 22.7075C16.6146 22.8005 16.5043 22.8742 16.3829 22.9246C16.2615 22.9749 16.1314 23.0008 15.9999 23.0008C15.8685 23.0008 15.7384 22.9749 15.617 22.9246C15.4956 22.8742 15.3853 22.8005 15.2924 22.7075L5.29245 12.7075C5.1048 12.5199 4.99939 12.2654 4.99939 12C4.99939 11.7346 5.1048 11.4801 5.29245 11.2925C5.48009 11.1049 5.73458 10.9995 5.99995 10.9995C6.26531 10.9995 6.5198 11.1049 6.70745 11.2925L15.9999 20.5863L25.2924 11.2925C25.3854 11.1996 25.4957 11.1259 25.6171 11.0756C25.7384 11.0253 25.8686 10.9995 25.9999 10.9995C26.1313 10.9995 26.2614 11.0253 26.3828 11.0756C26.5042 11.1259 26.6145 11.1996 26.7074 11.2925C26.8004 11.3854 26.8741 11.4957 26.9243 11.6171C26.9746 11.7385 27.0005 11.8686 27.0005 12C27.0005 12.1314 26.9746 12.2615 26.9243 12.3829C26.8741 12.5043 26.8004 12.6146 26.7074 12.7075Z" />
                                </svg>
                            </label>
                        </div>
                        <div class="block-parameters__item" required="">
                            <p class="block-parameters__text">Горизонт <span style="color: red;">*</span>   </p>
                            <div class="datepicker">
                                <input id="HorizonFrom" readonly type="text" autocomplete="off">
                                <span style="color: var(--color-primary);">-</span>
                                <input id="HorizonTo" readonly type="text" autocomplete="off">
                            </div>
                        </div>
                        <div class="block-parameters__item" field="scenarioUk">
                            <p class="block-parameters__text">Сценарий 1С УХ</p>
                            <div class="block-parameters__box" style="display: flex; gap: 0.5rem; align-items: center;">
                                <label class="dropdown">
                                    <select id="scenarioUK"></select>
                                    <svg width="18" height="18" viewBox="0 0 32 32" fill="#004C97"
                                        xmlns="http://www.w3.org/2000/svg">
                                        <path
                                            d="M26.7074 12.7075L16.7074 22.7075C16.6146 22.8005 16.5043 22.8742 16.3829 22.9246C16.2615 22.9749 16.1314 23.0008 15.9999 23.0008C15.8685 23.0008 15.7384 22.9749 15.617 22.9246C15.4956 22.8742 15.3853 22.8005 15.2924 22.7075L5.29245 12.7075C5.1048 12.5199 4.99939 12.2654 4.99939 12C4.99939 11.7346 5.1048 11.4801 5.29245 11.2925C5.48009 11.1049 5.73458 10.9995 5.99995 10.9995C6.26531 10.9995 6.5198 11.1049 6.70745 11.2925L15.9999 20.5863L25.2924 11.2925C25.3854 11.1996 25.4957 11.1259 25.6171 11.0756C25.7384 11.0253 25.8686 10.9995 25.9999 10.9995C26.1313 10.9995 26.2614 11.0253 26.3828 11.0756C26.5042 11.1259 26.6145 11.1996 26.7074 11.2925C26.8004 11.3854 26.8741 11.4957 26.9243 11.6171C26.9746 11.7385 27.0005 11.8686 27.0005 12C27.0005 12.1314 26.9746 12.2615 26.9243 12.3829C26.8741 12.5043 26.8004 12.6146 26.7074 12.7075Z" />
                                    </svg>
                                </label>
                                <svg btn="info" width="24" height="24" viewBox="0 0 32 32" fill="#004C97" xmlns="http://www.w3.org/2000/svg">
                                    <path d="M17.5 22.5C17.5 22.7967 17.412 23.0867 17.2472 23.3334C17.0824 23.58 16.8481 23.7723 16.574 23.8858C16.2999 23.9993 15.9983 24.0291 15.7074 23.9712C15.4164 23.9133 15.1491 23.7704 14.9393 23.5607C14.7296 23.3509 14.5867 23.0836 14.5288 22.7926C14.471 22.5017 14.5007 22.2001 14.6142 21.926C14.7277 21.6519 14.92 21.4176 15.1667 21.2528C15.4133 21.088 15.7033 21 16 21C16.3978 21 16.7794 21.158 17.0607 21.4393C17.342 21.7206 17.5 22.1022 17.5 22.5ZM16 9C13.2425 9 11 11.0188 11 13.5V14C11 14.2652 11.1054 14.5196 11.2929 14.7071C11.4804 14.8946 11.7348 15 12 15C12.2652 15 12.5196 14.8946 12.7071 14.7071C12.8946 14.5196 13 14.2652 13 14V13.5C13 12.125 14.3463 11 16 11C17.6538 11 19 12.125 19 13.5C19 14.875 17.6538 16 16 16C15.7348 16 15.4804 16.1054 15.2929 16.2929C15.1054 16.4804 15 16.7348 15 17V18C15 18.2652 15.1054 18.5196 15.2929 18.7071C15.4804 18.8946 15.7348 19 16 19C16.2652 19 16.5196 18.8946 16.7071 18.7071C16.8946 18.5196 17 18.2652 17 18V17.91C19.28 17.4913 21 15.6725 21 13.5C21 11.0188 18.7575 9 16 9ZM29 16C29 18.5712 28.2376 21.0846 26.8091 23.2224C25.3807 25.3603 23.3503 27.0265 20.9749 28.0104C18.5995 28.9944 15.9856 29.2518 13.4638 28.7502C10.9421 28.2486 8.6257 27.0105 6.80762 25.1924C4.98953 23.3743 3.75141 21.0579 3.2498 18.5362C2.74819 16.0144 3.00563 13.4006 3.98957 11.0251C4.97351 8.64968 6.63975 6.61935 8.77759 5.1909C10.9154 3.76244 13.4288 3 16 3C19.4467 3.00364 22.7512 4.37445 25.1884 6.81163C27.6256 9.24882 28.9964 12.5533 29 16ZM27 16C27 13.8244 26.3549 11.6977 25.1462 9.88873C23.9375 8.07979 22.2195 6.66989 20.2095 5.83733C18.1995 5.00476 15.9878 4.78692 13.854 5.21136C11.7202 5.6358 9.76021 6.68345 8.22183 8.22183C6.68345 9.7602 5.63581 11.7202 5.21137 13.854C4.78693 15.9878 5.00477 18.1995 5.83733 20.2095C6.66989 22.2195 8.07979 23.9375 9.88873 25.1462C11.6977 26.3549 13.8244 27 16 27C18.9164 26.9967 21.7123 25.8367 23.7745 23.7745C25.8367 21.7123 26.9967 18.9164 27 16Z" />
                                </svg>
                            </div>
                        </div>`);

                    self.initScenarioRCFFCombo($formScenario);
                    self.initScenarioUKCombo($formScenario);

                    $parent.append($formScenario);
                    // инициализируем после, из-за требований библиотеки 
                    self.initHorizonDatePicker();
                    break;
                case PrognozType.TYPE_1: // Ограниченная версия
                case PrognozType.TYPE_2: // Расширенная версия
                    const $form = $(`
                        ${ self.type === PrognozType.TYPE_1 ? 
                            `<div class="block-parameters__item">
                                <p class="block-parameters__text">Версия прогноза RCFF <span style="color: red;">*</span></p>
                                <label class="dropdown">
                                    <select id="versionRCFF"></select>
                                    <svg width="18" height="18" viewBox="0 0 32 32" fill="#004C97"
                                        xmlns="http://www.w3.org/2000/svg">
                                        <path
                                            d="M26.7074 12.7075L16.7074 22.7075C16.6146 22.8005 16.5043 22.8742 16.3829 22.9246C16.2615 22.9749 16.1314 23.0008 15.9999 23.0008C15.8685 23.0008 15.7384 22.9749 15.617 22.9246C15.4956 22.8742 15.3853 22.8005 15.2924 22.7075L5.29245 12.7075C5.1048 12.5199 4.99939 12.2654 4.99939 12C4.99939 11.7346 5.1048 11.4801 5.29245 11.2925C5.48009 11.1049 5.73458 10.9995 5.99995 10.9995C6.26531 10.9995 6.5198 11.1049 6.70745 11.2925L15.9999 20.5863L25.2924 11.2925C25.3854 11.1996 25.4957 11.1259 25.6171 11.0756C25.7384 11.0253 25.8686 10.9995 25.9999 10.9995C26.1313 10.9995 26.2614 11.0253 26.3828 11.0756C26.5042 11.1259 26.6145 11.1996 26.7074 11.2925C26.8004 11.3854 26.8741 11.4957 26.9243 11.6171C26.9746 11.7385 27.0005 11.8686 27.0005 12C27.0005 12.1314 26.9746 12.2615 26.9243 12.3829C26.8741 12.5043 26.8004 12.6146 26.7074 12.7075Z" />
                                    </svg>
                                </label>
                            </div>`: 
                            `<div class="block-parameters__item">
                                <p class="block-parameters__text">Сценарий прогноза RCFF <span style="color: red;">*</span></p>
                                <label class="dropdown">
                                    <select id="scenarioRCFF"></select>
                                    <svg width="18" height="18" viewBox="0 0 32 32" fill="#004C97"
                                        xmlns="http://www.w3.org/2000/svg">
                                        <path
                                            d="M26.7074 12.7075L16.7074 22.7075C16.6146 22.8005 16.5043 22.8742 16.3829 22.9246C16.2615 22.9749 16.1314 23.0008 15.9999 23.0008C15.8685 23.0008 15.7384 22.9749 15.617 22.9246C15.4956 22.8742 15.3853 22.8005 15.2924 22.7075L5.29245 12.7075C5.1048 12.5199 4.99939 12.2654 4.99939 12C4.99939 11.7346 5.1048 11.4801 5.29245 11.2925C5.48009 11.1049 5.73458 10.9995 5.99995 10.9995C6.26531 10.9995 6.5198 11.1049 6.70745 11.2925L15.9999 20.5863L25.2924 11.2925C25.3854 11.1996 25.4957 11.1259 25.6171 11.0756C25.7384 11.0253 25.8686 10.9995 25.9999 10.9995C26.1313 10.9995 26.2614 11.0253 26.3828 11.0756C26.5042 11.1259 26.6145 11.1996 26.7074 11.2925C26.8004 11.3854 26.8741 11.4957 26.9243 11.6171C26.9746 11.7385 27.0005 11.8686 27.0005 12C27.0005 12.1314 26.9746 12.2615 26.9243 12.3829C26.8741 12.5043 26.8004 12.6146 26.7074 12.7075Z" />
                                    </svg>
                                </label>
                            </div>`}
                        <div class="block-parameters__item">
                            <p class="block-parameters__text">Глубина ${ self.type === PrognozType.TYPE_2 ? `<span style="color: red;">*</span>` : ``}</p>
                            <div class="datepicker">
                                <input id="DepthFrom" readonly type="text" autocomplete="off">
                                <span style="color: var(--color-primary);">-</span>
                                <input id="DepthTo" readonly type="text" autocomplete="off">
                            </div>
                        </div>
                        <div class="block-parameters__item">
                            <p class="block-parameters__text">Горизонт ${ self.type === PrognozType.TYPE_2 ? `<span style="color: red;">*</span>` : ``}</p>
                            <div class="datepicker">
                                <input id="HorizonFrom" readonly type="text" autocomplete="off">
                                <span style="color: var(--color-primary);">-</span>
                                <input id="HorizonTo" readonly type="text" autocomplete="off">
                            </div>
                        </div>
                        <div class="block-parameters__item" field="scenarioUk" ${ self.type === PrognozType.TYPE_1 ? 'required=""' : ""}>
                            <p class="block-parameters__text">Сценарий 1С УХ ${ self.type === PrognozType.TYPE_1 ? '<span style="color: red;">*</span>' : ""}</p>
                            <div class="block-parameters__box" style="display: flex; gap: 0.5rem; align-items: center;">
                                <label class="dropdown">
                                    <select id="scenarioUK"></select>
                                    <svg width="18" height="18" viewBox="0 0 32 32" fill="#004C97"
                                        xmlns="http://www.w3.org/2000/svg">
                                        <path
                                            d="M26.7074 12.7075L16.7074 22.7075C16.6146 22.8005 16.5043 22.8742 16.3829 22.9246C16.2615 22.9749 16.1314 23.0008 15.9999 23.0008C15.8685 23.0008 15.7384 22.9749 15.617 22.9246C15.4956 22.8742 15.3853 22.8005 15.2924 22.7075L5.29245 12.7075C5.1048 12.5199 4.99939 12.2654 4.99939 12C4.99939 11.7346 5.1048 11.4801 5.29245 11.2925C5.48009 11.1049 5.73458 10.9995 5.99995 10.9995C6.26531 10.9995 6.5198 11.1049 6.70745 11.2925L15.9999 20.5863L25.2924 11.2925C25.3854 11.1996 25.4957 11.1259 25.6171 11.0756C25.7384 11.0253 25.8686 10.9995 25.9999 10.9995C26.1313 10.9995 26.2614 11.0253 26.3828 11.0756C26.5042 11.1259 26.6145 11.1996 26.7074 11.2925C26.8004 11.3854 26.8741 11.4957 26.9243 11.6171C26.9746 11.7385 27.0005 11.8686 27.0005 12C27.0005 12.1314 26.9746 12.2615 26.9243 12.3829C26.8741 12.5043 26.8004 12.6146 26.7074 12.7075Z" />
                                    </svg>
                                </label>
                                <svg btn="info" width="24" height="24" viewBox="0 0 32 32" fill="#004C97" xmlns="http://www.w3.org/2000/svg">
                                    <path d="M17.5 22.5C17.5 22.7967 17.412 23.0867 17.2472 23.3334C17.0824 23.58 16.8481 23.7723 16.574 23.8858C16.2999 23.9993 15.9983 24.0291 15.7074 23.9712C15.4164 23.9133 15.1491 23.7704 14.9393 23.5607C14.7296 23.3509 14.5867 23.0836 14.5288 22.7926C14.471 22.5017 14.5007 22.2001 14.6142 21.926C14.7277 21.6519 14.92 21.4176 15.1667 21.2528C15.4133 21.088 15.7033 21 16 21C16.3978 21 16.7794 21.158 17.0607 21.4393C17.342 21.7206 17.5 22.1022 17.5 22.5ZM16 9C13.2425 9 11 11.0188 11 13.5V14C11 14.2652 11.1054 14.5196 11.2929 14.7071C11.4804 14.8946 11.7348 15 12 15C12.2652 15 12.5196 14.8946 12.7071 14.7071C12.8946 14.5196 13 14.2652 13 14V13.5C13 12.125 14.3463 11 16 11C17.6538 11 19 12.125 19 13.5C19 14.875 17.6538 16 16 16C15.7348 16 15.4804 16.1054 15.2929 16.2929C15.1054 16.4804 15 16.7348 15 17V18C15 18.2652 15.1054 18.5196 15.2929 18.7071C15.4804 18.8946 15.7348 19 16 19C16.2652 19 16.5196 18.8946 16.7071 18.7071C16.8946 18.5196 17 18.2652 17 18V17.91C19.28 17.4913 21 15.6725 21 13.5C21 11.0188 18.7575 9 16 9ZM29 16C29 18.5712 28.2376 21.0846 26.8091 23.2224C25.3807 25.3603 23.3503 27.0265 20.9749 28.0104C18.5995 28.9944 15.9856 29.2518 13.4638 28.7502C10.9421 28.2486 8.6257 27.0105 6.80762 25.1924C4.98953 23.3743 3.75141 21.0579 3.2498 18.5362C2.74819 16.0144 3.00563 13.4006 3.98957 11.0251C4.97351 8.64968 6.63975 6.61935 8.77759 5.1909C10.9154 3.76244 13.4288 3 16 3C19.4467 3.00364 22.7512 4.37445 25.1884 6.81163C27.6256 9.24882 28.9964 12.5533 29 16ZM27 16C27 13.8244 26.3549 11.6977 25.1462 9.88873C23.9375 8.07979 22.2195 6.66989 20.2095 5.83733C18.1995 5.00476 15.9878 4.78692 13.854 5.21136C11.7202 5.6358 9.76021 6.68345 8.22183 8.22183C6.68345 9.7602 5.63581 11.7202 5.21137 13.854C4.78693 15.9878 5.00477 18.1995 5.83733 20.2095C6.66989 22.2195 8.07979 23.9375 9.88873 25.1462C11.6977 26.3549 13.8244 27 16 27C18.9164 26.9967 21.7123 25.8367 23.7745 23.7745C25.8367 21.7123 26.9967 18.9164 27 16Z" />
                                </svg>
                            </div>
                        </div>
                        <div class="block-parameters__item" field="Manage">
                            <p class="block-parameters__text" style="height: 18px;"></p>
                            <div class="block-parameters__box" style="display: flex; gap: 0.5rem; align-items: center; height: 42px;">
                                <input type="checkbox" id="isManage" style="height: 20px; width: 20px" checked>
                                <p class="block-parameters__text">Учитывать упр. версию</p>
                            </div>
                        </div>
                        `);
                    if(self.type === PrognozType.TYPE_1){
                        self.initVersionRCFFCombo($form);

                        setTimeout(() => {
                            this.prognoz.loadingVersionData();
                        }, 100);

                    }else{
                        self.initScenarioRCFFCombo($form);
                        // заполняем если переключились между версиями
                        setTimeout(() => {
                            this.prognoz.loadingScenariosPrognozData();
                        }, 100);
                    }
                    if($titleBlock.length > 0){
                        $titleBlock.text('Параметры')
                    }
                    self.initScenarioUKCombo($form);

                    $parent.append($form);

                    self.initHorizonDatePicker();
                    self.initDepthDatePicker();
                    break;
                case 3:
                        const $formManager = $(`
                        <div class="block-parameters__item">
                            <p class="block-parameters__text">Период создания версии</p>
                            <div class="datepicker">
                                <input id="creationFrom" readonly type="text" autocomplete="off">
                                <span style="color: var(--color-primary);">-</span>
                                <input id="creationTo" readonly type="text" autocomplete="off">
                            </div>
                        </div>
                        <div class="block-parameters__item">
                            <p class="block-parameters__text">Вид сценария</p>
                            <label class="dropdown">
                                <select id="scenType"></select>
                                <svg width="18" height="18" viewBox="0 0 32 32" fill="#004C97"
                                    xmlns="http://www.w3.org/2000/svg">
                                    <path
                                        d="M26.7074 12.7075L16.7074 22.7075C16.6146 22.8005 16.5043 22.8742 16.3829 22.9246C16.2615 22.9749 16.1314 23.0008 15.9999 23.0008C15.8685 23.0008 15.7384 22.9749 15.617 22.9246C15.4956 22.8742 15.3853 22.8005 15.2924 22.7075L5.29245 12.7075C5.1048 12.5199 4.99939 12.2654 4.99939 12C4.99939 11.7346 5.1048 11.4801 5.29245 11.2925C5.48009 11.1049 5.73458 10.9995 5.99995 10.9995C6.26531 10.9995 6.5198 11.1049 6.70745 11.2925L15.9999 20.5863L25.2924 11.2925C25.3854 11.1996 25.4957 11.1259 25.6171 11.0756C25.7384 11.0253 25.8686 10.9995 25.9999 10.9995C26.1313 10.9995 26.2614 11.0253 26.3828 11.0756C26.5042 11.1259 26.6145 11.1996 26.7074 11.2925C26.8004 11.3854 26.8741 11.4957 26.9243 11.6171C26.9746 11.7385 27.0005 11.8686 27.0005 12C27.0005 12.1314 26.9746 12.2615 26.9243 12.3829C26.8741 12.5043 26.8004 12.6146 26.7074 12.7075Z" />
                                </svg>
                            </label>
                        </div>
                        <div class="block-parameters__item">
                            <p class="block-parameters__text">Версия прогноза</p>
                            <label class="search">
                                <svg id="serachToList" style="cursor: pointer;" width="24" height="24" viewBox="0 0 32 32" fill="#004C97" xmlns="http://www.w3.org/2000/svg">
                                    <path d="M28.7075 27.2925L22.4488 21.035C24.2628 18.8571 25.1674 16.0637 24.9743 13.2359C24.7813 10.4081 23.5054 7.76357 21.4122 5.85247C19.319 3.94136 16.5696 2.91082 13.7359 2.97522C10.9023 3.03962 8.20249 4.194 6.19827 6.19823C4.19404 8.20246 3.03966 10.9022 2.97526 13.7359C2.91086 16.5696 3.9414 19.319 5.85251 21.4122C7.76361 23.5054 10.4081 24.7812 13.236 24.9743C16.0638 25.1674 18.8572 24.2628 21.035 22.4488L27.2925 28.7075C27.3855 28.8004 27.4958 28.8741 27.6171 28.9244C27.7385 28.9747 27.8686 29.0006 28 29.0006C28.1314 29.0006 28.2615 28.9747 28.3829 28.9244C28.5043 28.8741 28.6146 28.8004 28.7075 28.7075C28.8005 28.6146 28.8742 28.5043 28.9244 28.3829C28.9747 28.2615 29.0006 28.1314 29.0006 28C29.0006 27.8686 28.9747 27.7385 28.9244 27.6171C28.8742 27.4957 28.8005 27.3854 28.7075 27.2925ZM5.00004 14C5.00004 12.22 5.52788 10.4799 6.51681 8.99987C7.50575 7.51983 8.91136 6.36628 10.5559 5.68509C12.2004 5.0039 14.01 4.82567 15.7559 5.17294C17.5017 5.5202 19.1053 6.37737 20.364 7.63604C21.6227 8.89471 22.4798 10.4984 22.8271 12.2442C23.1744 13.99 22.9961 15.7996 22.315 17.4442C21.6338 19.0887 20.4802 20.4943 19.0002 21.4832C17.5201 22.4722 15.7801 23 14 23C11.6139 22.9974 9.32626 22.0483 7.639 20.361C5.95175 18.6738 5.00269 16.3861 5.00004 14Z"></path>
                                </svg>
                                <select id="search"></select>
                            </label>
                        </div>`);

                        if($titleBlock.length > 0){
                            $titleBlock.text('Фильтр')
                        }

                        self.initScenTypeCombo($formManager);
                        self.initSearch($formManager);
                        $parent.append($formManager);
                        
                        self.initCreationDatePicker();
                    break;
                default:
                    window.Reports.common.showDialog(PrognozMessages.COULD_NOT_DETERMINE_SCENARIO);

              }
    }
}
